#pandas --> series and data frame
#series --> 1D homogeneous array, size immutable
#data frame --> 2D array, heterogeneous 

# PANDAS

# SERIES

In [4]:
import pandas as pd

In [5]:
s= pd.Series([23,45,67,23,16], index = range(100, 105))

In [6]:
s

100    23
101    45
102    67
103    23
104    16
dtype: int64

In [7]:
s= pd.Series([23,45,67,23,16, 1.45])

In [8]:
s

0    23.00
1    45.00
2    67.00
3    23.00
4    16.00
5     1.45
dtype: float64

In [9]:
s.dtype

dtype('float64')

In [10]:
type(s)

pandas.core.series.Series

In [11]:
s[2] = 56

In [12]:
s

0    23.00
1    45.00
2    56.00
3    23.00
4    16.00
5     1.45
dtype: float64

In [13]:
s[101]

KeyError: 101

# DATAFRAME

In [ ]:
roll = pd.Series([1,2,3,4,5])
name = pd.Series(['Akash', 'Riya', 'Natasha', 'Naveen', 'Raj'])
marks = pd.Series([78.78, 67.87, 84.67, 85.01,59.00] )

In [ ]:
df = pd.DataFrame({
    'roll': roll,
    'name' : name,
    'marks' : marks
})

In [ ]:
df

In [ ]:
df.ndim

In [ ]:
df.Shape

In [ ]:
df.shape

In [ ]:
df.size

In [14]:
df.columns

NameError: name 'df' is not defined

In [15]:
import os
os.getcwd()

'C:\\Users\\mihik'

In [16]:
pwd

'C:\\Users\\mihik'

# DOWNLOAD THE DATASET

In [17]:
# LOCATION : https://mitu.co.in/dataset
# download all the files starting from student* and place in the same director as you jupyter notebook

In [18]:
df = pd.read_csv('student1.csv')

In [19]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [20]:
df1= pd.read_csv('student2.csv')

In [21]:
df1

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [22]:
header=['A', 'B','C', 'D', 'E']
df1 = pd.read_csv('student1.csv', names = header)
#csv --> comma separated values

In [23]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [24]:
df2= pd.read_csv('student3.tsv', sep = '\t')
#tsc --> tab separatedvalues

In [25]:
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [26]:
df2.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [27]:
df.values

array([[2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df1.head(7)

   A        B   C      D   E
0  1     anil  TE  56.77  22
1  2     amit  TE  59.77  21
2  3   aniket  BE  76.88  19
3  4  ajinkya  TE  69.66  20
4  5     asha  TE  63.28  20
5  6   ayesha  BE  49.55  20
6  7     amar  BE  65.34  19

In [30]:
df1.sum()

A                                                   55
B    anilamitaniketajinkyaashaayeshaamaramitaamolanmol
C                                 TETEBETETEBEBEBETEBE
D                                               644.99
E                                                  205
dtype: object

In [31]:
df1.max()

A        10
B    ayesha
C        TE
D     78.66
E        23
dtype: object

In [32]:
df1.count()

A    10
B    10
C    10
D    10
E    10
dtype: int64

In [33]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     object
 2   C       10 non-null     object
 3   D       10 non-null     float64
 4   E       10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [34]:
df.describe()

               1      56.77         22
count   9.000000   9.000000   9.000000
mean    6.000000  65.357778  20.333333
std     2.738613   9.331227   1.224745
min     2.000000  49.550000  19.000000
25%     4.000000  59.770000  20.000000
50%     6.000000  65.340000  20.000000
75%     8.000000  69.660000  21.000000
max    10.000000  78.660000  23.000000

### DATA SLICING

In [35]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [36]:
df.iloc[3:8]

   1    anil  TE  56.77  22
3  5    asha  TE  63.28  20
4  6  ayesha  BE  49.55  20
5  7    amar  BE  65.34  19
6  8   amita  BE  68.33  23
7  9    amol  TE  56.75  20

In [37]:
df.iloc[3:8, 1:4]

     anil  TE  56.77
3    asha  TE  63.28
4  ayesha  BE  49.55
5    amar  BE  65.34
6   amita  BE  68.33
7    amol  TE  56.75

In [38]:
df.iloc[0:8, 0:3]

   1     anil  TE
0  2     amit  TE
1  3   aniket  BE
2  4  ajinkya  TE
3  5     asha  TE
4  6   ayesha  BE
5  7     amar  BE
6  8    amita  BE
7  9     amol  TE

In [39]:
df.iloc[0:8, 1:4:2]

      anil  56.77
0     amit  59.77
1   aniket  76.88
2  ajinkya  69.66
3     asha  63.28
4   ayesha  49.55
5     amar  65.34
6    amita  68.33
7     amol  56.75

In [40]:
df.iloc[:, [1,3]]

      anil  56.77
0     amit  59.77
1   aniket  76.88
2  ajinkya  69.66
3     asha  63.28
4   ayesha  49.55
5     amar  65.34
6    amita  68.33
7     amol  56.75
8    anmol  78.66

In [41]:
df.loc[:,'name']

KeyError: 'name'

In [ ]:
x = df.loc[:,['name', 'marks']]

In [ ]:
x

In [ ]:
df.drop(4)

In [ ]:
df.drop([1,2,3,4,5])

In [ ]:
df.drop('class', axis = 1)

In [ ]:
cols = {'roll': 'ID', 'marks':'grade'}

In [ ]:
df.rename(columns = cols)

In [ ]:
r = {0: 'zero', 1:'one'}

In [ ]:
df.rename(index = r)

# sort the data

In [ ]:
df.sort_values(by = 'class')

In [ ]:
df.sort_values(by = 'age')

In [ ]:
df.sort_values(by = ['class','marks'])

In [ ]:
df.sort_values(by = ['roll','marks'])

In [ ]:
df.sort_values(by = 'class', ascending = False)

# String methods

In [ ]:
df['name'].str.upper()

In [ ]:
df['name'].str.swapcase()

In [ ]:
df['name'].str.title()

In [ ]:
df['name'].str.lower()

In [ ]:
df['class'].str.isupper()

In [ ]:
df['name'].str.len()

In [ ]:
df['name'].str.contains('m')

In [ ]:
df['name'].str.isnumeric()

In [ ]:
df['name'].str.repeat(2)

#### Add or modify a new column

In [ ]:
df

In [ ]:
df['roll'] = df['roll'] + 100

In [ ]:
df

In [ ]:
gender = ['m', 'm', 'm', 'm', 'f', 'f', 'f', 'm', 'f', 'm']

In [70]:
df['gender'] = gender

NameError: name 'gender' is not defined

In [ ]:
df

In [ ]:
cgpa =( marks/10) + 0.5

In [ ]:
df['cgpa'] = cgpa

In [ ]:
df

In [ ]:
df['cgpa'] = df['marks']/10 + 0.5

In [ ]:
df

In [ ]:
df['gender'].value_counts()

In [ ]:
df['class'].value_counts()

In [ ]:
df['gender'].mode()

In [ ]:
df['class'].mode()

In [ ]:
df['class'].mode()[0]

# GROUP OPERATIONS

In [59]:
gr = df2.groupby('class')

In [60]:
gr

### mean , median, min, sum

In [61]:
import warnings
warnings.filterwarnings('ignore')

In [62]:
gr['marks'].agg(max)

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

In [63]:
import numpy as np

In [68]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [64]:
gr['marks'].agg([np.mean, max, min, np.median])

         mean    max    min  median
class
BE     67.752  78.66  49.55   68.33
TE     61.246  69.66  56.75   59.77

In [67]:
df.drop(['gender','cgpa'], axis = 1, inplace = True)

KeyError: "['gender', 'cgpa'] not found in axis"

# merging dataframe

In [69]:
# create dataframe containing ==> roll, cgpa, gender, where roll is same as df

In [71]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [72]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [73]:
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [74]:
# now use df2 idiot

In [91]:
gender = ['m', 'f', 'm', 'm', 'f','m','f','m','f','f']
cgpa = df2['marks']/10 + 0.5
roll = range(1,11)

In [92]:
df0 = pd.DataFrame({
    'roll' : roll,
    'gender' : gender,
    'cgpa' : cgpa
})

In [93]:
df0

   roll gender   cgpa
0     1      m  6.177
1     2      f  6.477
2     3      m  8.188
3     4      m  7.466
4     5      f  6.828
5     6      m  5.455
6     7      f  7.034
7     8      m  7.333
8     9      f  6.175
9    10      f  8.366

# MERGE DATAFRAME

In [94]:
pd.merge(df, df0, on='roll')

KeyError: 'roll'

In [96]:
df2 =pd.read_csv('student5.csv')

In [97]:
df2

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [99]:
df

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [103]:
pd.concat([df,df2], ignore_index = True)

       1     anil   TE  56.77    22  roll     name class  marks   age
0    2.0     amit   TE  59.77  21.0   NaN      NaN   NaN    NaN   NaN
1    3.0   aniket   BE  76.88  19.0   NaN      NaN   NaN    NaN   NaN
2    4.0  ajinkya   TE  69.66  20.0   NaN      NaN   NaN    NaN   NaN
3    5.0     asha   TE  63.28  20.0   NaN      NaN   NaN    NaN   NaN
4    6.0   ayesha   BE  49.55  20.0   NaN      NaN   NaN    NaN   NaN
5    7.0     amar   BE  65.34  19.0   NaN      NaN   NaN    NaN   NaN
6    8.0    amita   BE  68.33  23.0   NaN      NaN   NaN    NaN   NaN
7    9.0     amol   TE  56.75  20.0   NaN      NaN   NaN    NaN   NaN
8   10.0    anmol   BE  78.66  21.0   NaN      NaN   NaN    NaN   NaN
9    NaN      NaN  NaN    NaN   NaN   1.0   surbhi    TE  67.44  23.0
10   NaN      NaN  NaN    NaN   NaN   2.0    sujay    TE  74.12  22.0
11   NaN      NaN  NaN    NaN   NaN   3.0  subhash    BE  82.44  21.0
12   NaN      NaN  NaN    NaN   NaN   4.0   sachin    TE  59.33  21.0
13   NaN      NaN  NaN    NaN   NaN   5.0  shalini    TE  63.45  20.0

# BOOLEAN FILTERING`

In [118]:
mark = df2['marks'] > 60

In [119]:
df2[df2['marks'] > 60]

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
4     5  shalini    TE  63.45   20

In [120]:
df2[(df2['marks'] > 60) & (df2['class'] == 'BE')]

   roll     name class  marks  age
2     3  subhash    BE  82.44   21

In [123]:
df2[(df2['name'].str.contains('s'))]

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

# EXPORT THE DATA

In [124]:
x= df2[(df2['marks'] > 60) & (df2['class'] == 'BE')]

In [125]:
x

   roll     name class  marks  age
2     3  subhash    BE  82.44   21

In [127]:
x.to_csv('output.csv', index = False)